Autodesk.Revit.DB.BeamSystemJustifyType
Describes the justify method of beamsystem.

Autodesk.Revit.DB.BeamSystemJustifyType.DirectionLine
DirectionLine.

Autodesk.Revit.DB.BeamSystemJustifyType.Beginning
Beginning.

Autodesk.Revit.DB.BeamSystemJustifyType.End
End.

Autodesk.Revit.DB.BeamSystemJustifyType.Center
Center.